### What is Groupby in Pandas ?

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame( {
      "key1":list("aabbab"),
      "key2":["one","two","three"]*2,
    "Data1":np.random.randn(6),
    "Data2":np.random.randn(6)
})

df

  key1   key2     Data1     Data2
0    a    one  1.182283  0.921968
1    a    two  1.495698 -1.605413
2    b  three  0.144527  0.056348
3    b    one  0.136047 -1.066131
4    a    two -0.373136  1.522894
5    b  three -1.114647 -0.500888

In [5]:
df["key1"]

0    a
1    a
2    b
3    b
4    a
5    b
Name: key1, dtype: object

In [20]:
df["Data1"].groupby(df["key1"]).mean()

key1
a    0.768282
b   -0.278024
Name: Data1, dtype: float64

In [14]:
(1.182283+1.495698+-0.373136)/3

0.7682816666666666

In [21]:
type(df["Data1"].groupby(df["key1"]).mean())

pandas.core.series.Series

In [19]:
df.groupby(df["key1"]).median()

         Data1     Data2
key1
a     1.182283  0.921968
b     0.136047 -0.500888

In [22]:
type(df.groupby(df["key1"]).median())

pandas.core.frame.DataFrame

In [25]:
df.groupby([df["key1"],
                    df["key2"]]).mean()

               Data1     Data2
key1 key2
a    one    1.182283  0.921968
     two    0.561281 -0.041260
b    one    0.136047 -1.066131
     three -0.485060 -0.222270

In [28]:
ave=df.groupby([df["key1"],
                    df["key2"]]).mean()
ave.stack()

key1  key2
a     one    Data1    1.182283
             Data2    0.921968
      two    Data1    0.561281
             Data2   -0.041260
b     one    Data1    0.136047
             Data2   -1.066131
      three  Data1   -0.485060
             Data2   -0.222270
dtype: float64

In [29]:
ave=df.groupby([df["key1"],df["key2"]]).median()
ave

               Data1     Data2
key1 key2
a    one    1.182283  0.921968
     two    0.561281 -0.041260
b    one    0.136047 -1.066131
     three -0.485060 -0.222270

In [30]:
ave=df.groupby([df["key1"],df["key2"]]).sum()
ave

               Data1     Data2
key1 key2
a    one    1.182283  0.921968
     two    1.122562 -0.082519
b    one    0.136047 -1.066131
     three -0.970120 -0.444539

In [31]:
ave=df.groupby([df["key1"],df["key2"]]).min()
ave

               Data1     Data2
key1 key2
a    one    1.182283  0.921968
     two   -0.373136 -1.605413
b    one    0.136047 -1.066131
     three -1.114647 -0.500888

In [32]:
ave=df.groupby([df["key1"],df["key2"]]).max()
ave

               Data1     Data2
key1 key2
a    one    1.182283  0.921968
     two    1.495698  1.522894
b    one    0.136047 -1.066131
     three  0.144527  0.056348

In [33]:
ave=df.groupby([df["key1"],df["key2"]]).count()
ave

            Data1  Data2
key1 key2
a    one        1      1
     two        2      2
b    one        1      1
     three      2      2

In [38]:
df.groupby(df["key1"]).agg({"Data1":["min","max","mean","median","sum","count"]})

         Data1
           min       max      mean    median       sum count
key1
a    -0.373136  1.495698  0.768282  1.182283  2.304845     3
b    -1.114647  0.144527 -0.278024  0.136047 -0.834073     3

In [41]:
df.groupby([df["key1"],df["key2"]]).agg({"Data1":["min","max","mean","median","sum","count"]})

               Data1
                 min       max      mean    median       sum count
key1 key2
a    one    1.182283  1.182283  1.182283  1.182283  1.182283     1
     two   -0.373136  1.495698  0.561281  0.561281  1.122562     2
b    one    0.136047  0.136047  0.136047  0.136047  0.136047     1
     three -1.114647  0.144527 -0.485060 -0.485060 -0.970120     2

In [42]:
df.groupby([df["key1"],df["key2"]]).agg({"Data1":["min","max","mean","median","sum","count"]}).reset_index()

  key1   key2     Data1
                    min       max      mean    median       sum count
0    a    one  1.182283  1.182283  1.182283  1.182283  1.182283     1
1    a    two -0.373136  1.495698  0.561281  0.561281  1.122562     2
2    b    one  0.136047  0.136047  0.136047  0.136047  0.136047     1
3    b  three -1.114647  0.144527 -0.485060 -0.485060 -0.970120     2

In [43]:
df.groupby(df["key1"]).agg({"Data1":["min","max","mean","median","sum","count"],
                                         "Data2":["min","max","count"]}).reset_index()

  key1     Data1                                                   Data2  \
             min       max      mean    median       sum count       min
0    a -0.373136  1.495698  0.768282  1.182283  2.304845     3 -1.605413
1    b -1.114647  0.144527 -0.278024  0.136047 -0.834073     3 -1.066131


        max count
0  1.522894     3
1  0.056348     3

In [44]:
df.groupby([df["key1"],df["key2"]]).agg({"Data1":["min","max","mean","median","sum","count"],
                                         "Data2":["min","max","count"]}).reset_index()

  key1   key2     Data1                                                \
                    min       max      mean    median       sum count
0    a    one  1.182283  1.182283  1.182283  1.182283  1.182283     1
1    a    two -0.373136  1.495698  0.561281  0.561281  1.122562     2
2    b    one  0.136047  0.136047  0.136047  0.136047  0.136047     1
3    b  three -1.114647  0.144527 -0.485060 -0.485060 -0.970120     2

      Data2
        min       max count
0  0.921968  0.921968     1
1 -1.605413  1.522894     2
2 -1.066131 -1.066131     1
3 -0.500888  0.056348     2

In [24]:
df["Data1"].groupby([df["key1"],
                    df["key2"]]).mean()

key1  key2
a     one      1.182283
      two      0.561281
b     one      0.136047
      three   -0.485060
Name: Data1, dtype: float64

### Indexing & Selection & Filtering in Pandas

In DataFrame there are two method of indexing
1. iloc - integer based indexing
2. loc  - label based indexing

In [46]:
data=pd.Series(np.arange(5),
              index=["a","b","c","d","e"])

In [47]:
data

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [50]:
data.iloc[:2]

a    0
b    1
dtype: int32

In [52]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=["London","Paris",
           "Berlin","Istanbul"],
    columns=["one","two","three","four"])
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [55]:
data.iloc[1,[1,2,3]] 

#before comma rows, after comma column
#rows columns

two      5
three    6
four     7
Name: Paris, dtype: int32

In [56]:
data.iloc[0,[1,2,3]]

two      1
three    2
four     3
Name: London, dtype: int32

In [57]:
data.iloc[[1,2],[1,2,3]]

        two  three  four
Paris     5      6     7
Berlin    9     10    11

In [58]:
data.iloc[[1,2],[2,3]]

        three  four
Paris       6     7
Berlin     10    11

loc - label based indexing

In [60]:
data.loc["Paris",["one","two"]]

one    4
two    5
Name: Paris, dtype: int32

In [62]:
data.loc["Paris":,"four"]

Paris        7
Berlin      11
Istanbul    15
Name: four, dtype: int32

In [63]:
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

How to drop a column four

In [64]:
data.drop("four",axis=1,inplace=True)
data

          one  two  three
London      0    1      2
Paris       4    5      6
Berlin      8    9     10
Istanbul   12   13     14

Adding a column

In [65]:
data["four"]=[3,7,11,15]
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15